Revit 2021.1 API
WallSweepInfo.WallOffset Property
 The offset from the sweep or reveal to the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2012
Syntax
C#
public double WallOffset { get; set; }
Visual Basic
Public Property WallOffset As Double
	Get
	Set
Visual C++
public:
property double WallOffset {
	double get ();
	void set (double value);
}
Field Value
 A negative value moves the sweep toward the wall core.
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace